AldanisVigo/QuestGamePIC32USBandC/lib/pic32mx_usb_cdc/pic32_usb_cdc.c
#include "pic32_usb_cdc.h"

#include <string.h>
#include <sys/kmem.h>
#include <xc.h>

#ifndef U1CON
#error "pic32_usb_cdc.c requires a PIC32MX/PIC32MZ device with USBFS U1 registers."
#endif

#ifndef PIC32_USB_CDC_EP0_SIZE
#define PIC32_USB_CDC_EP0_SIZE 8U
#endif

#ifndef PIC32_USB_CDC_BULK_SIZE
#define PIC32_USB_CDC_BULK_SIZE 64U
#endif

#ifndef PIC32_USB_CDC_INT_SIZE
#define PIC32_USB_CDC_INT_SIZE 16U
#endif

#ifndef PIC32_USB_CDC_RX_BUFFER_SIZE
#define PIC32_USB_CDC_RX_BUFFER_SIZE 256U
#endif

#ifndef PIC32_USB_CDC_TX_BUFFER_SIZE
#define PIC32_USB_CDC_TX_BUFFER_SIZE 256U
#endif

#ifndef PIC32_USB_CDC_DEFAULT_VID
#define PIC32_USB_CDC_DEFAULT_VID 0x04D8U
#endif

#ifndef PIC32_USB_CDC_DEFAULT_PID
#define PIC32_USB_CDC_DEFAULT_PID 0x0001U
#endif

#ifndef PIC32_USB_CDC_DEFAULT_BCD_DEVICE
#define PIC32_USB_CDC_DEFAULT_BCD_DEVICE 0x0100U
#endif

#ifndef PIC32_USB_CDC_MAX_STRING_DESCRIPTOR
#define PIC32_USB_CDC_MAX_STRING_DESCRIPTOR 64U
#endif

#define USB_EP0 0U
#define USB_EP_CDC_NOTIFICATION 1U
#define USB_EP_CDC_OUT 2U
#define USB_EP_CDC_IN 3U
#define USB_ENDPOINTS 4U

#define USB_DIR_RX 0U
#define USB_DIR_TX 1U
#define USB_PP_EVEN 0U
#define USB_PP_ODD 1U

#define USB_BD_STALL 0x04U
#define USB_BD_DTS 0x08U
#define USB_BD_DATA1 0x40U
#define USB_BD_UOWN 0x80U
#define USB_BD_PID_MASK 0x3CU
#define USB_PID_OUT 0x04U
#define USB_PID_IN 0x24U
#define USB_PID_SETUP 0x34U

#define USB_REQ_GET_STATUS 0x00U
#define USB_REQ_CLEAR_FEATURE 0x01U
#define USB_REQ_SET_FEATURE 0x03U
#define USB_REQ_SET_ADDRESS 0x05U
#define USB_REQ_GET_DESCRIPTOR 0x06U
#define USB_REQ_GET_CONFIGURATION 0x08U
#define USB_REQ_SET_CONFIGURATION 0x09U
#define USB_REQ_GET_INTERFACE 0x0AU
#define USB_REQ_SET_INTERFACE 0x0BU

#define USB_DESC_DEVICE 0x01U
#define USB_DESC_CONFIGURATION 0x02U
#define USB_DESC_STRING 0x03U
#define USB_DESC_INTERFACE 0x04U
#define USB_DESC_ENDPOINT 0x05U
#define USB_DESC_CS_INTERFACE 0x24U

#define USB_CDC_SET_LINE_CODING 0x20U
#define USB_CDC_GET_LINE_CODING 0x21U
#define USB_CDC_SET_CONTROL_LINE_STATE 0x22U
#define USB_CDC_SEND_BREAK 0x23U

#define USB_RECIP_DEVICE 0x00U
#define USB_RECIP_INTERFACE 0x01U
#define USB_RECIP_ENDPOINT 0x02U
#define USB_RECIP_MASK 0x1FU

#define USB_FEATURE_ENDPOINT_HALT 0x00U

#define USB_EP_ATTR_CONTROL 0x0DU
#define USB_EP_ATTR_TX_HANDSHAKE 0x05U
#define USB_EP_ATTR_RX_HANDSHAKE 0x09U

#define U16_LO(v) ((uint8_t)((uint16_t)(v) & 0xFFU))
#define U16_HI(v) ((uint8_t)(((uint16_t)(v) >> 8) & 0xFFU))

typedef union __attribute__((packed, aligned(4)))
{
    uint8_t byte[8];
    uint16_t half[4];
    uint32_t word[2];
} Pic32UsbBdtEntry;

typedef struct
{
    uint8_t bmRequestType;
    uint8_t bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} UsbSetupPacket;

typedef enum
{
    CTRL_IDLE = 0,
    CTRL_IN_DATA,
    CTRL_OUT_DATA,
    CTRL_STATUS_IN,
    CTRL_STATUS_OUT
} ControlState;

typedef struct
{
    ControlState state;
    UsbSetupPacket setup;
    const uint8_t *source;
    uint16_t total;
    uint16_t sent;
    uint16_t received;
    bool need_zlp;
    uint8_t pending_request;
} ControlTransfer;

static volatile Pic32UsbBdtEntry usb_bdt[USB_ENDPOINTS * 4U] __attribute__((coherent, aligned(512)));
static uint8_t ep0_rx_buffer[2][PIC32_USB_CDC_EP0_SIZE] __attribute__((coherent, aligned(16)));
static uint8_t ep0_tx_buffer[PIC32_USB_CDC_EP0_SIZE] __attribute__((coherent, aligned(16)));
static uint8_t ep0_out_buffer[16] __attribute__((coherent, aligned(16)));
static uint8_t bulk_rx_buffer[2][PIC32_USB_CDC_BULK_SIZE] __attribute__((coherent, aligned(16)));
static uint8_t bulk_tx_buffer[PIC32_USB_CDC_BULK_SIZE] __attribute__((coherent, aligned(16)));
static uint8_t notify_buffer[PIC32_USB_CDC_INT_SIZE] __attribute__((coherent, aligned(16)));

static uint8_t rx_ring[PIC32_USB_CDC_RX_BUFFER_SIZE];
static uint8_t tx_ring[PIC32_USB_CDC_TX_BUFFER_SIZE];
static uint8_t device_descriptor[18];
static uint8_t string_descriptor[PIC32_USB_CDC_MAX_STRING_DESCRIPTOR];

static const uint8_t language_string_descriptor[] = {4U, USB_DESC_STRING, 0x09U, 0x04U};

static const uint8_t configuration_descriptor[] =
{
    0x09U, USB_DESC_CONFIGURATION, 0x43U, 0x00U, 0x02U, 0x01U, 0x00U, 0x80U, 50U,
    0x09U, USB_DESC_INTERFACE, 0x00U, 0x00U, 0x01U, 0x02U, 0x02U, 0x01U, 0x00U,
    0x05U, USB_DESC_CS_INTERFACE, 0x00U, 0x20U, 0x01U,
    0x04U, USB_DESC_CS_INTERFACE, 0x02U, 0x02U,
    0x05U, USB_DESC_CS_INTERFACE, 0x06U, 0x00U, 0x01U,
    0x05U, USB_DESC_CS_INTERFACE, 0x01U, 0x00U, 0x01U,
    0x07U, USB_DESC_ENDPOINT, (uint8_t)(0x80U | USB_EP_CDC_NOTIFICATION), 0x03U,
    U16_LO(PIC32_USB_CDC_INT_SIZE), U16_HI(PIC32_USB_CDC_INT_SIZE), 0x02U,
    0x09U, USB_DESC_INTERFACE, 0x01U, 0x00U, 0x02U, 0x0AU, 0x00U, 0x00U, 0x00U,
    0x07U, USB_DESC_ENDPOINT, USB_EP_CDC_OUT, 0x02U,
    U16_LO(PIC32_USB_CDC_BULK_SIZE), U16_HI(PIC32_USB_CDC_BULK_SIZE), 0x00U,
    0x07U, USB_DESC_ENDPOINT, (uint8_t)(0x80U | USB_EP_CDC_IN), 0x02U,
    U16_LO(PIC32_USB_CDC_BULK_SIZE), U16_HI(PIC32_USB_CDC_BULK_SIZE), 0x00U
};

static PIC32_USB_CDC_Config usb_config;
static PIC32_USB_CDC_State usb_state = PIC32_USB_CDC_STATE_DETACHED;
static PIC32_USB_CDC_State state_before_suspend = PIC32_USB_CDC_STATE_DETACHED;
static PIC32_USB_CDC_LineCoding line_coding = {115200UL, 0U, 0U, 8U};
static ControlTransfer ctrl;

static uint16_t rx_head;
static uint16_t rx_tail;
static uint16_t tx_head;
static uint16_t tx_tail;
static uint32_t rx_dropped;

static uint8_t next_pp[USB_ENDPOINTS][2];
static uint8_t next_tx_data[USB_ENDPOINTS];
static uint8_t configuration_value;
static uint8_t pending_address = 0xFFU;
static bool usb_suspended;
static bool cdc_dtr;
static bool cdc_rts;
static bool bulk_tx_busy;
static bool notify_tx_busy;

static void usb_log(const char *message)
{
    if (usb_config.debug_log != NULL)
    {
        usb_config.debug_log(message);
    }
}

static void set_state(PIC32_USB_CDC_State state)
{
    if (usb_state != state)
    {
        usb_state = state;
        if (usb_config.on_state_changed != NULL)
        {
            usb_config.on_state_changed(state);
        }
    }
}

