AldanisVigo/QuestGamePIC32USBandC/lib/pic32mx_usb_cdc/pic32_usb_cdc.c
static uint16_t min_u16(uint16_t a, uint16_t b)
{
    return (a < b) ? a : b;
}

static uint16_t ring_next(uint16_t value, uint16_t size)
{
    value++;
    return (value >= size) ? 0U : value;
}

static size_t rx_count(void)
{
    if (rx_head >= rx_tail)
    {
        return (size_t)(rx_head - rx_tail);
    }
    return (size_t)(PIC32_USB_CDC_RX_BUFFER_SIZE - rx_tail + rx_head);
}

static size_t tx_count(void)
{
    if (tx_head >= tx_tail)
    {
        return (size_t)(tx_head - tx_tail);
    }
    return (size_t)(PIC32_USB_CDC_TX_BUFFER_SIZE - tx_tail + tx_head);
}

static void rx_push(uint8_t value)
{
    uint16_t next = ring_next(rx_head, PIC32_USB_CDC_RX_BUFFER_SIZE);

    if (next == rx_tail)
    {
        rx_dropped++;
        return;
    }

    rx_ring[rx_head] = value;
    rx_head = next;
}

static bool tx_pop(uint8_t *value)
{
    if (tx_tail == tx_head)
    {
        return false;
    }

    *value = tx_ring[tx_tail];
    tx_tail = ring_next(tx_tail, PIC32_USB_CDC_TX_BUFFER_SIZE);
    return true;
}

static uint8_t bdt_index(uint8_t endpoint, uint8_t direction, uint8_t ping_pong)
{
    return (uint8_t)((endpoint * 4U) + (direction * 2U) + ping_pong);
}

static void bdt_clear_all(void)
{
    uint8_t i;

    for (i = 0U; i < (USB_ENDPOINTS * 4U); i++)
    {
        usb_bdt[i].word[0] = 0U;
        usb_bdt[i].word[1] = 0U;
    }
}

static void bdt_arm_rx(uint8_t endpoint, uint8_t ping_pong, void *buffer, uint16_t size)
{
    volatile Pic32UsbBdtEntry *bd = &usb_bdt[bdt_index(endpoint, USB_DIR_RX, ping_pong)];

    bd->byte[0] = 0U;
    bd->word[1] = KVA_TO_PA(buffer);
    bd->half[1] = size;
    bd->byte[0] = USB_BD_UOWN;
}

static void bdt_arm_rx_next(uint8_t endpoint, void *buffer, uint16_t size)
{
    uint8_t ping_pong = next_pp[endpoint][USB_DIR_RX];

    bdt_arm_rx(endpoint, ping_pong, buffer, size);
    next_pp[endpoint][USB_DIR_RX] ^= 1U;
}

static void bdt_arm_tx_next(uint8_t endpoint, const void *buffer, uint16_t size)
{
    uint8_t ping_pong = next_pp[endpoint][USB_DIR_TX];
    volatile Pic32UsbBdtEntry *bd = &usb_bdt[bdt_index(endpoint, USB_DIR_TX, ping_pong)];
    uint8_t status = USB_BD_DTS;

    if (next_tx_data[endpoint] != 0U)
    {
        status |= USB_BD_DATA1;
    }

    bd->byte[0] = 0U;
    bd->word[1] = KVA_TO_PA(buffer);
    bd->half[1] = size;
    bd->byte[0] = (uint8_t)(status | USB_BD_UOWN);

    next_pp[endpoint][USB_DIR_TX] ^= 1U;
    next_tx_data[endpoint] ^= 1U;
}

static void bdt_stall_ep0(void)
{
    volatile Pic32UsbBdtEntry *tx_even = &usb_bdt[bdt_index(USB_EP0, USB_DIR_TX, USB_PP_EVEN)];
    volatile Pic32UsbBdtEntry *tx_odd = &usb_bdt[bdt_index(USB_EP0, USB_DIR_TX, USB_PP_ODD)];

    tx_even->byte[0] = (uint8_t)(USB_BD_STALL | USB_BD_UOWN);
    tx_odd->byte[0] = (uint8_t)(USB_BD_STALL | USB_BD_UOWN);
    U1EP0SET = _U1EP0_EPSTALL_MASK;
    ctrl.state = CTRL_IDLE;
}

static void endpoint_clear_stall(uint8_t endpoint)
{
    switch (endpoint)
    {
        case USB_EP0:
            U1EP0CLR = _U1EP0_EPSTALL_MASK;
            break;
        case USB_EP_CDC_NOTIFICATION:
            U1EP1CLR = _U1EP1_EPSTALL_MASK;
            break;
        case USB_EP_CDC_OUT:
            U1EP2CLR = _U1EP2_EPSTALL_MASK;
            break;
        case USB_EP_CDC_IN:
            U1EP3CLR = _U1EP3_EPSTALL_MASK;
            break;
        default:
            break;
    }
}

static void endpoint_set_stall(uint8_t endpoint)
{
    switch (endpoint)
    {
        case USB_EP0:
            U1EP0SET = _U1EP0_EPSTALL_MASK;
            break;
        case USB_EP_CDC_NOTIFICATION:
            U1EP1SET = _U1EP1_EPSTALL_MASK;
            break;
        case USB_EP_CDC_OUT:
            U1EP2SET = _U1EP2_EPSTALL_MASK;
            break;
        case USB_EP_CDC_IN:
            U1EP3SET = _U1EP3_EPSTALL_MASK;
            break;
        default:
            break;
    }
}

static bool endpoint_is_stalled(uint8_t endpoint)
{
    switch (endpoint)
    {
        case USB_EP0:
            return (U1EP0bits.EPSTALL != 0U);
        case USB_EP_CDC_NOTIFICATION:
            return (U1EP1bits.EPSTALL != 0U);
        case USB_EP_CDC_OUT:
            return (U1EP2bits.EPSTALL != 0U);
        case USB_EP_CDC_IN:
            return (U1EP3bits.EPSTALL != 0U);
        default:
            return false;
    }
}

static void build_device_descriptor(void)
{
    uint16_t vid = (usb_config.vid == 0U) ? PIC32_USB_CDC_DEFAULT_VID : usb_config.vid;
    uint16_t pid = (usb_config.pid == 0U) ? PIC32_USB_CDC_DEFAULT_PID : usb_config.pid;
    uint16_t bcd = (usb_config.bcd_device == 0U) ? PIC32_USB_CDC_DEFAULT_BCD_DEVICE : usb_config.bcd_device;
    uint8_t serial_index = ((usb_config.serial_number != NULL) && (usb_config.serial_number[0] != '\0')) ? 3U : 0U;

    device_descriptor[0] = 18U;
    device_descriptor[1] = USB_DESC_DEVICE;
    device_descriptor[2] = 0x00U;
    device_descriptor[3] = 0x02U;
    device_descriptor[4] = 0x02U;
    device_descriptor[5] = 0x02U;
    device_descriptor[6] = 0x00U;
    device_descriptor[7] = PIC32_USB_CDC_EP0_SIZE;
    device_descriptor[8] = U16_LO(vid);
    device_descriptor[9] = U16_HI(vid);
    device_descriptor[10] = U16_LO(pid);
    device_descriptor[11] = U16_HI(pid);
    device_descriptor[12] = U16_LO(bcd);
    device_descriptor[13] = U16_HI(bcd);
    device_descriptor[14] = 1U;
    device_descriptor[15] = 2U;
    device_descriptor[16] = serial_index;
    device_descriptor[17] = 1U;
}

static const uint8_t *make_string_descriptor(uint8_t index, uint16_t *length)
{
    const char *text = NULL;
    uint8_t pos = 2U;

    if (index == 0U)
    {
        *length = sizeof(language_string_descriptor);
        return language_string_descriptor;
    }

    if (index == 1U)
    {
        text = usb_config.manufacturer;
    }
    else if (index == 2U)
    {
        text = usb_config.product;
    }
    else if (index == 3U)
    {
        text = usb_config.serial_number;
    }

    if ((text == NULL) || (text[0] == '\0'))
    {
        return NULL;
    }

    while ((text[0] != '\0') && ((uint16_t)(pos + 1U) < PIC32_USB_CDC_MAX_STRING_DESCRIPTOR))
    {
        string_descriptor[pos++] = (uint8_t)*text++;
        string_descriptor[pos++] = 0U;
    }

