AldanisVigo/QuestGamePIC32USBandC/lib/pic32mx_usb_cdc/pic32_usb_cdc.c
    string_descriptor[0] = pos;
    string_descriptor[1] = USB_DESC_STRING;
    *length = pos;
    return string_descriptor;
}

static void ep0_send_next(void)
{
    uint16_t remaining;
    uint16_t chunk;

    if (ctrl.sent < ctrl.total)
    {
        remaining = (uint16_t)(ctrl.total - ctrl.sent);
        chunk = min_u16(remaining, PIC32_USB_CDC_EP0_SIZE);
        (void)memcpy(ep0_tx_buffer, &ctrl.source[ctrl.sent], chunk);
        ctrl.sent = (uint16_t)(ctrl.sent + chunk);
        bdt_arm_tx_next(USB_EP0, ep0_tx_buffer, chunk);
        return;
    }

    if (ctrl.need_zlp)
    {
        ctrl.need_zlp = false;
        bdt_arm_tx_next(USB_EP0, ep0_tx_buffer, 0U);
        return;
    }

    ctrl.state = CTRL_STATUS_OUT;
}

static void control_send(const uint8_t *data, uint16_t actual_length, uint16_t requested_length)
{
    ctrl.source = data;
    ctrl.total = min_u16(actual_length, requested_length);
    ctrl.sent = 0U;
    ctrl.received = 0U;
    ctrl.need_zlp = ((actual_length < requested_length) && ((actual_length % PIC32_USB_CDC_EP0_SIZE) == 0U));
    ctrl.state = CTRL_IN_DATA;
    ep0_send_next();
}

static void control_send_status_in(void)
{
    ctrl.state = CTRL_STATUS_IN;
    ctrl.sent = 0U;
    ctrl.total = 0U;
    ctrl.need_zlp = false;
    bdt_arm_tx_next(USB_EP0, ep0_tx_buffer, 0U);
}

static void control_expect_out(uint8_t request, uint16_t expected_length)
{
    ctrl.state = CTRL_OUT_DATA;
    ctrl.pending_request = request;
    ctrl.total = min_u16(expected_length, sizeof(ep0_out_buffer));
    ctrl.received = 0U;
}

static void apply_out_control_data(void)
{
    if ((ctrl.pending_request == USB_CDC_SET_LINE_CODING) && (ctrl.received >= 7U))
    {
        line_coding.baud_rate = (uint32_t)ep0_out_buffer[0]
            | ((uint32_t)ep0_out_buffer[1] << 8)
            | ((uint32_t)ep0_out_buffer[2] << 16)
            | ((uint32_t)ep0_out_buffer[3] << 24);
        line_coding.stop_bits = ep0_out_buffer[4];
        line_coding.parity = ep0_out_buffer[5];
        line_coding.data_bits = ep0_out_buffer[6];

        if (usb_config.on_line_coding_changed != NULL)
        {
            usb_config.on_line_coding_changed(&line_coding);
        }
    }
}

static void configure_data_endpoints(uint8_t config_value)
{
    configuration_value = config_value;
    bulk_tx_busy = false;
    notify_tx_busy = false;
    next_tx_data[USB_EP_CDC_NOTIFICATION] = 0U;
    next_tx_data[USB_EP_CDC_IN] = 0U;
    next_pp[USB_EP_CDC_NOTIFICATION][USB_DIR_TX] = 0U;
    next_pp[USB_EP_CDC_OUT][USB_DIR_RX] = 0U;
    next_pp[USB_EP_CDC_IN][USB_DIR_TX] = 0U;

    if (config_value == 1U)
    {
        U1EP1 = USB_EP_ATTR_TX_HANDSHAKE;
        U1EP2 = USB_EP_ATTR_RX_HANDSHAKE;
        U1EP3 = USB_EP_ATTR_TX_HANDSHAKE;
        bdt_arm_rx_next(USB_EP_CDC_OUT, bulk_rx_buffer[USB_PP_EVEN], PIC32_USB_CDC_BULK_SIZE);
        bdt_arm_rx_next(USB_EP_CDC_OUT, bulk_rx_buffer[USB_PP_ODD], PIC32_USB_CDC_BULK_SIZE);
        (void)memset(notify_buffer, 0, sizeof(notify_buffer));
        set_state(PIC32_USB_CDC_STATE_CONFIGURED);
        usb_log("USB configured");
    }
    else
    {
        U1EP1 = 0U;
        U1EP2 = 0U;
        U1EP3 = 0U;
        set_state((U1ADDRbits.DEVADDR == 0U) ? PIC32_USB_CDC_STATE_DEFAULT : PIC32_USB_CDC_STATE_ADDRESSED);
        usb_log("USB unconfigured");
    }
}

static void handle_get_status(void)
{
    uint8_t recipient = (uint8_t)(ctrl.setup.bmRequestType & USB_RECIP_MASK);

    ep0_tx_buffer[0] = 0U;
    ep0_tx_buffer[1] = 0U;

    if (recipient == USB_RECIP_ENDPOINT)
    {
        uint8_t endpoint = (uint8_t)(ctrl.setup.wIndex & 0x0FU);
        if (endpoint_is_stalled(endpoint))
        {
            ep0_tx_buffer[0] = 1U;
        }
    }

    control_send(ep0_tx_buffer, 2U, ctrl.setup.wLength);
}

static void handle_get_descriptor(void)
{
    uint8_t descriptor_type = (uint8_t)(ctrl.setup.wValue >> 8);
    uint8_t descriptor_index = (uint8_t)(ctrl.setup.wValue & 0xFFU);
    const uint8_t *descriptor = NULL;
    uint16_t length = 0U;

    switch (descriptor_type)
    {
        case USB_DESC_DEVICE:
            descriptor = device_descriptor;
            length = sizeof(device_descriptor);
            break;

        case USB_DESC_CONFIGURATION:
            descriptor = configuration_descriptor;
            length = sizeof(configuration_descriptor);
            break;

        case USB_DESC_STRING:
            descriptor = make_string_descriptor(descriptor_index, &length);
            break;

        default:
            break;
    }

    if (descriptor == NULL)
    {
        bdt_stall_ep0();
        return;
    }

    control_send(descriptor, length, ctrl.setup.wLength);
}

static void handle_standard_request(void)
{
    static uint8_t one_byte_response;
    uint8_t recipient;
    uint8_t endpoint;

    switch (ctrl.setup.bRequest)
    {
        case USB_REQ_GET_STATUS:
            handle_get_status();
            break;

        case USB_REQ_CLEAR_FEATURE:
            recipient = (uint8_t)(ctrl.setup.bmRequestType & USB_RECIP_MASK);
            if ((recipient == USB_RECIP_ENDPOINT) && (ctrl.setup.wValue == USB_FEATURE_ENDPOINT_HALT))
            {
                endpoint = (uint8_t)(ctrl.setup.wIndex & 0x0FU);
                endpoint_clear_stall(endpoint);
                control_send_status_in();
            }
            else
            {
                bdt_stall_ep0();
            }
            break;

        case USB_REQ_SET_FEATURE:
            recipient = (uint8_t)(ctrl.setup.bmRequestType & USB_RECIP_MASK);
            if ((recipient == USB_RECIP_ENDPOINT) && (ctrl.setup.wValue == USB_FEATURE_ENDPOINT_HALT))
            {
                endpoint = (uint8_t)(ctrl.setup.wIndex & 0x0FU);
                endpoint_set_stall(endpoint);
                control_send_status_in();
            }
            else
            {
                bdt_stall_ep0();
            }
            break;

        case USB_REQ_SET_ADDRESS:
            pending_address = (uint8_t)(ctrl.setup.wValue & 0x7FU);
            control_send_status_in();
            break;

        case USB_REQ_GET_DESCRIPTOR:
            handle_get_descriptor();
            break;

        case USB_REQ_GET_CONFIGURATION:
            one_byte_response = configuration_value;
            control_send(&one_byte_response, 1U, ctrl.setup.wLength);
            break;

        case USB_REQ_SET_CONFIGURATION:
            configure_data_endpoints((uint8_t)(ctrl.setup.wValue & 0xFFU));
            control_send_status_in();
            break;

        case USB_REQ_GET_INTERFACE:
            one_byte_response = 0U;
            control_send(&one_byte_response, 1U, ctrl.setup.wLength);
            break;

        case USB_REQ_SET_INTERFACE:
            if (ctrl.setup.wValue == 0U)
            {
                control_send_status_in();
            }
            else
            {
                bdt_stall_ep0();
            }
            break;

        default:
            bdt_stall_ep0();
            break;
    }
}

static void handle_cdc_request(void)
{
    uint8_t data[7];
    bool new_dtr;
    bool new_rts;

    switch (ctrl.setup.bRequest)
    {
        case USB_CDC_SET_LINE_CODING:
            if (ctrl.setup.wLength == 7U)
            {
                control_expect_out(USB_CDC_SET_LINE_CODING, 7U);
            }
            else
            {
                bdt_stall_ep0();
            }
            break;

