AldanisVigo/QuestGamePIC32USBandC/lib/pic32mx_usb_cdc/pic32_usb_cdc.c
        case USB_CDC_GET_LINE_CODING:
            data[0] = (uint8_t)(line_coding.baud_rate & 0xFFU);
            data[1] = (uint8_t)((line_coding.baud_rate >> 8) & 0xFFU);
            data[2] = (uint8_t)((line_coding.baud_rate >> 16) & 0xFFU);
            data[3] = (uint8_t)((line_coding.baud_rate >> 24) & 0xFFU);
            data[4] = line_coding.stop_bits;
            data[5] = line_coding.parity;
            data[6] = line_coding.data_bits;
            (void)memcpy(ep0_tx_buffer, data, sizeof(data));
            control_send(ep0_tx_buffer, sizeof(data), ctrl.setup.wLength);
            break;

        case USB_CDC_SET_CONTROL_LINE_STATE:
            new_dtr = ((ctrl.setup.wValue & 0x0001U) != 0U);
            new_rts = ((ctrl.setup.wValue & 0x0002U) != 0U);
            if ((new_dtr != cdc_dtr) || (new_rts != cdc_rts))
            {
                cdc_dtr = new_dtr;
                cdc_rts = new_rts;
                if (usb_config.on_control_line_changed != NULL)
                {
                    usb_config.on_control_line_changed(cdc_dtr, cdc_rts);
                }
            }
            control_send_status_in();
            break;

        case USB_CDC_SEND_BREAK:
            control_send_status_in();
            break;

        default:
            bdt_stall_ep0();
            break;
    }
}

static void handle_setup_packet(const uint8_t *setup_bytes)
{
    ctrl.setup.bmRequestType = setup_bytes[0];
    ctrl.setup.bRequest = setup_bytes[1];
    ctrl.setup.wValue = (uint16_t)setup_bytes[2] | ((uint16_t)setup_bytes[3] << 8);
    ctrl.setup.wIndex = (uint16_t)setup_bytes[4] | ((uint16_t)setup_bytes[5] << 8);
    ctrl.setup.wLength = (uint16_t)setup_bytes[6] | ((uint16_t)setup_bytes[7] << 8);
    ctrl.state = CTRL_IDLE;
    ctrl.source = NULL;
    ctrl.pending_request = 0U;
    next_tx_data[USB_EP0] = 1U;
    U1EP0CLR = _U1EP0_EPSTALL_MASK;
    usb_bdt[bdt_index(USB_EP0, USB_DIR_TX, USB_PP_EVEN)].byte[0] = 0U;
    usb_bdt[bdt_index(USB_EP0, USB_DIR_TX, USB_PP_ODD)].byte[0] = 0U;
    U1CONCLR = _U1CON_PKTDIS_MASK;

    if ((ctrl.setup.bmRequestType & 0x60U) == 0x00U)
    {
        handle_standard_request();
    }
    else if ((ctrl.setup.bmRequestType & 0x60U) == 0x20U)
    {
        handle_cdc_request();
    }
    else
    {
        bdt_stall_ep0();
    }
}

static void service_tx(void)
{
    uint16_t count = 0U;

    if ((usb_state != PIC32_USB_CDC_STATE_CONFIGURED) || bulk_tx_busy)
    {
        return;
    }

    while ((count < PIC32_USB_CDC_BULK_SIZE) && tx_pop(&bulk_tx_buffer[count]))
    {
        count++;
    }

    if (count > 0U)
    {
        bulk_tx_busy = true;
        bdt_arm_tx_next(USB_EP_CDC_IN, bulk_tx_buffer, count);
    }
}

static void handle_ep0_rx(uint8_t ping_pong, uint8_t pid, uint16_t count)
{
    uint8_t *buffer = ep0_rx_buffer[ping_pong];
    uint16_t copy_count;

    if (pid == USB_PID_SETUP)
    {
        handle_setup_packet(buffer);
    }
    else if (pid == USB_PID_OUT)
    {
        if (ctrl.state == CTRL_OUT_DATA)
        {
            copy_count = count;
            if ((uint16_t)(copy_count + ctrl.received) > ctrl.total)
            {
                copy_count = (uint16_t)(ctrl.total - ctrl.received);
            }

            if (copy_count > 0U)
            {
                (void)memcpy(&ep0_out_buffer[ctrl.received], buffer, copy_count);
                ctrl.received = (uint16_t)(ctrl.received + copy_count);
            }

            if ((ctrl.received >= ctrl.total) || (count < PIC32_USB_CDC_EP0_SIZE))
            {
                apply_out_control_data();
                control_send_status_in();
            }
        }
        else if (ctrl.state == CTRL_STATUS_OUT)
        {
            ctrl.state = CTRL_IDLE;
        }
    }

    bdt_arm_rx(USB_EP0, ping_pong, ep0_rx_buffer[ping_pong], PIC32_USB_CDC_EP0_SIZE);
}

static void handle_ep0_tx_complete(void)
{
    if (ctrl.state == CTRL_IN_DATA)
    {
        ep0_send_next();
    }
    else if (ctrl.state == CTRL_STATUS_IN)
    {
        if (pending_address != 0xFFU)
        {
            U1ADDR = pending_address;
            set_state((pending_address == 0U) ? PIC32_USB_CDC_STATE_DEFAULT : PIC32_USB_CDC_STATE_ADDRESSED);
            pending_address = 0xFFU;
        }
        ctrl.state = CTRL_IDLE;
    }
}

static void handle_bulk_rx(uint8_t ping_pong, uint16_t count)
{
    uint16_t i;

    for (i = 0U; i < count; i++)
    {
        rx_push(bulk_rx_buffer[ping_pong][i]);
    }

    bdt_arm_rx(USB_EP_CDC_OUT, ping_pong, bulk_rx_buffer[ping_pong], PIC32_USB_CDC_BULK_SIZE);
}

static void handle_token_done(void)
{
    uint32_t stat;
    uint8_t endpoint;
    uint8_t direction;
    uint8_t ping_pong;
    volatile Pic32UsbBdtEntry *bd;
    uint8_t pid;
    uint16_t count;

    while ((U1IR & _U1IR_TRNIF_MASK) != 0U)
    {
        stat = U1STAT;
        direction = ((stat & _U1STAT_DIR_MASK) != 0U) ? USB_DIR_TX : USB_DIR_RX;
        ping_pong = ((stat & _U1STAT_PPBI_MASK) != 0U) ? USB_PP_ODD : USB_PP_EVEN;
        endpoint = (uint8_t)((stat & _U1STAT_ENDPT_MASK) >> _U1STAT_ENDPT_POSITION);
        bd = &usb_bdt[bdt_index(endpoint, direction, ping_pong)];
        pid = (uint8_t)(bd->byte[0] & USB_BD_PID_MASK);
        count = bd->half[1];
        U1IRCLR = _U1IR_TRNIF_MASK;

        if (endpoint == USB_EP0)
        {
            if (direction == USB_DIR_RX)
            {
                handle_ep0_rx(ping_pong, pid, count);
            }
            else
            {
                bd->byte[0] = 0U;
                handle_ep0_tx_complete();
            }
        }
        else if ((endpoint == USB_EP_CDC_OUT) && (direction == USB_DIR_RX))
        {
            handle_bulk_rx(ping_pong, count);
        }
        else if ((endpoint == USB_EP_CDC_IN) && (direction == USB_DIR_TX))
        {
            bd->byte[0] = 0U;
            bulk_tx_busy = false;
            service_tx();
        }
        else if ((endpoint == USB_EP_CDC_NOTIFICATION) && (direction == USB_DIR_TX))
        {
            bd->byte[0] = 0U;
            notify_tx_busy = false;
        }
        else
        {
            bd->byte[0] = 0U;
        }
    }
}

static void bus_reset(void)
{
    uint8_t ep;

    U1CONSET = _U1CON_PPBRST_MASK;
    U1CONCLR = _U1CON_PPBRST_MASK;
    U1ADDR = 0U;
    U1EP0 = USB_EP_ATTR_CONTROL;
    U1EP1 = 0U;
    U1EP2 = 0U;
    U1EP3 = 0U;
    bdt_clear_all();

    for (ep = 0U; ep < USB_ENDPOINTS; ep++)
    {
        next_pp[ep][USB_DIR_RX] = 0U;
        next_pp[ep][USB_DIR_TX] = 0U;
        next_tx_data[ep] = 0U;
    }

    configuration_value = 0U;
    pending_address = 0xFFU;
    bulk_tx_busy = false;
    notify_tx_busy = false;
    ctrl.state = CTRL_IDLE;
    cdc_dtr = false;
    cdc_rts = false;
    next_tx_data[USB_EP0] = 1U;
    bdt_arm_rx_next(USB_EP0, ep0_rx_buffer[USB_PP_EVEN], PIC32_USB_CDC_EP0_SIZE);
    bdt_arm_rx_next(USB_EP0, ep0_rx_buffer[USB_PP_ODD], PIC32_USB_CDC_EP0_SIZE);
    set_state(PIC32_USB_CDC_STATE_DEFAULT);
    usb_log("USB reset");
}

static void set_bdt_base_address(void)
{
    uint32_t address = KVA_TO_PA((void *)usb_bdt);

