AldanisVigo/QuestGamePIC32USBandC/lib/pic32mx_usb_cdc/pic32_usb_cdc.c
    U1BDTP3bits.BDTPTRU = (uint8_t)((address >> 24) & 0xFFU);
    U1BDTP2bits.BDTPTRH = (uint8_t)((address >> 16) & 0xFFU);
    U1BDTP1bits.BDTPTRL = (uint8_t)((address >> 9) & 0x7FU);
}

void PIC32_USB_CDC_ConfigDefault(PIC32_USB_CDC_Config *config)
{
    if (config == NULL)
    {
        return;
    }

    config->vid = PIC32_USB_CDC_DEFAULT_VID;
    config->pid = PIC32_USB_CDC_DEFAULT_PID;
    config->bcd_device = PIC32_USB_CDC_DEFAULT_BCD_DEVICE;
    config->manufacturer = "VigoBeatz";
    config->product = "VQuest CDC";
    config->serial_number = "";
    config->on_line_coding_changed = NULL;
    config->on_control_line_changed = NULL;
    config->on_state_changed = NULL;
    config->debug_log = NULL;
}

void PIC32_USB_CDC_Init(const PIC32_USB_CDC_Config *config)
{
    PIC32_USB_CDC_ConfigDefault(&usb_config);
    if (config != NULL)
    {
        usb_config = *config;
        if (usb_config.manufacturer == NULL)
        {
            usb_config.manufacturer = "VigoBeatz";
        }
        if (usb_config.product == NULL)
        {
            usb_config.product = "VQuest CDC";
        }
    }

    build_device_descriptor();
    rx_head = 0U;
    rx_tail = 0U;
    tx_head = 0U;
    tx_tail = 0U;
    rx_dropped = 0U;
    line_coding.baud_rate = 115200UL;
    line_coding.stop_bits = 0U;
    line_coding.parity = 0U;
    line_coding.data_bits = 8U;
    usb_suspended = false;
    state_before_suspend = PIC32_USB_CDC_STATE_DETACHED;

    U1PWRCSET = _U1PWRC_USBPWR_MASK;
    U1CON = 0U;
    U1IE = 0U;
    U1EIE = 0U;
    U1IRCLR = 0xFFU;
    U1EIRCLR = 0xFFU;
    set_bdt_base_address();
    bus_reset();
    U1IE = (uint32_t)(_U1IE_URSTIE_MASK | _U1IE_TRNIE_MASK | _U1IE_IDLEIE_MASK
        | _U1IE_RESUMEIE_MASK | _U1IE_STALLIE_MASK | _U1IE_UERRIE_MASK);
    U1EIE = 0xFFU;
    U1CONSET = _U1CON_USBEN_MASK;
    usb_log("USB CDC initialized");
}

void PIC32_USB_CDC_Detach(void)
{
    U1CONCLR = _U1CON_USBEN_MASK;
    U1PWRCCLR = _U1PWRC_USBPWR_MASK;
    set_state(PIC32_USB_CDC_STATE_DETACHED);
}

void PIC32_USB_CDC_Task(void)
{
    if ((U1IR & _U1IR_URSTIF_MASK) != 0U)
    {
        U1IRCLR = _U1IR_URSTIF_MASK;
        usb_suspended = false;
        bus_reset();
    }

    if ((U1IR & _U1IR_UERRIF_MASK) != 0U)
    {
        U1EIRCLR = 0xFFU;
        U1IRCLR = _U1IR_UERRIF_MASK;
        usb_log("USB error flags cleared");
    }

    handle_token_done();

    if ((U1IR & _U1IR_STALLIF_MASK) != 0U)
    {
        endpoint_clear_stall(USB_EP0);
        U1IRCLR = _U1IR_STALLIF_MASK;
    }

    if ((U1IR & _U1IR_IDLEIF_MASK) != 0U)
    {
        U1IRCLR = _U1IR_IDLEIF_MASK;
        if (!usb_suspended)
        {
            usb_suspended = true;
            state_before_suspend = usb_state;
            set_state(PIC32_USB_CDC_STATE_SUSPENDED);
            usb_log("USB suspended");
        }
    }

    if ((U1IR & _U1IR_RESUMEIF_MASK) != 0U)
    {
        U1IRCLR = _U1IR_RESUMEIF_MASK;
        if (usb_suspended)
        {
            usb_suspended = false;
            set_state(state_before_suspend);
            usb_log("USB resumed");
        }
    }

    service_tx();
}

PIC32_USB_CDC_State PIC32_USB_CDC_StateGet(void)
{
    return usb_state;
}

bool PIC32_USB_CDC_Configured(void)
{
    return (usb_state == PIC32_USB_CDC_STATE_CONFIGURED);
}

bool PIC32_USB_CDC_IsOpen(void)
{
    return PIC32_USB_CDC_Configured() && cdc_dtr;
}

bool PIC32_USB_CDC_Suspended(void)
{
    return usb_suspended;
}

size_t PIC32_USB_CDC_Read(void *buffer, size_t length)
{
    uint8_t *out = (uint8_t *)buffer;
    size_t count = 0U;

    if ((buffer == NULL) || (length == 0U))
    {
        return 0U;
    }

    while ((count < length) && (rx_tail != rx_head))
    {
        out[count++] = rx_ring[rx_tail];
        rx_tail = ring_next(rx_tail, PIC32_USB_CDC_RX_BUFFER_SIZE);
    }

    return count;
}

size_t PIC32_USB_CDC_Write(const void *buffer, size_t length)
{
    const uint8_t *in = (const uint8_t *)buffer;
    size_t count = 0U;

    if ((buffer == NULL) || (length == 0U) || !PIC32_USB_CDC_Configured())
    {
        return 0U;
    }

    while (count < length)
    {
        uint16_t next = ring_next(tx_head, PIC32_USB_CDC_TX_BUFFER_SIZE);
        if (next == tx_tail)
        {
            break;
        }
        tx_ring[tx_head] = in[count++];
        tx_head = next;
    }

    service_tx();
    return count;
}

size_t PIC32_USB_CDC_WriteString(const char *text)
{
    if (text == NULL)
    {
        return 0U;
    }

    return PIC32_USB_CDC_Write(text, strlen(text));
}

size_t PIC32_USB_CDC_RxAvailable(void)
{
    return rx_count();
}

size_t PIC32_USB_CDC_TxAvailable(void)
{
    return (PIC32_USB_CDC_TX_BUFFER_SIZE - 1U) - tx_count();
}

uint32_t PIC32_USB_CDC_RxDropped(void)
{
    return rx_dropped;
}

const PIC32_USB_CDC_LineCoding *PIC32_USB_CDC_LineCodingGet(void)
{
    return &line_coding;
}

bool PIC32_USB_CDC_DTR(void)
{
    return cdc_dtr;
}

bool PIC32_USB_CDC_RTS(void)
{
    return cdc_rts;
}
